Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 4190)]       0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 4190, 1)      0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 4182, 8)      80          reshape[0][0]                    
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 4164, 8)      224         reshape[0][0]                    
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 4110, 8)      656         reshape[0][0]                    
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 3948, 8)      1952        reshape[0][0]                    
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 3462, 8)      5840        reshape[0][0]                    
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 1045, 8)      0           conv1d[0][0]                     
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 1041, 8)      0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 1027, 8)      0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 987, 8)       0           conv1d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_8 (MaxPooling1D)  (None, 865, 8)       0           conv1d_8[0][0]                   
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 1037, 16)     1168        max_pooling1d[0][0]              
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 1015, 16)     3472        max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 947, 16)      10384       max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 745, 16)      31120       max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 137, 16)      93328       max_pooling1d_8[0][0]            
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 259, 16)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 253, 16)      0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 236, 16)      0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 186, 16)      0           conv1d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_9 (MaxPooling1D)  (None, 34, 16)       0           conv1d_9[0][0]                   
__________________________________________________________________________________________________
flatten (Flatten)               (None, 4144)         0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 4048)         0           max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 3776)         0           max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 2976)         0           max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 544)          0           max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 4144)         0           flatten[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 4048)         0           flatten_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 3776)         0           flatten_2[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 2976)         0           flatten_3[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 544)          0           flatten_4[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 15488)        0           dropout[0][0]                    
                                                                 dropout_1[0][0]                  
                                                                 dropout_2[0][0]                  
                                                                 dropout_3[0][0]                  
                                                                 dropout_4[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 2000)         30978000    concatenate[0][0]                
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1000)         2001000     dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 500)          500500      dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 500)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2)            1002        dropout_5[0][0]                  
==================================================================================================
Total params: 33,628,726
Trainable params: 33,628,726
Non-trainable params: 0
__________________________________________________________________________________________________
