Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_3 (Reshape)          (None, 1440, 1)           0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 1438, 8)           32        
_________________________________________________________________
max_pooling1d_12 (MaxPooling (None, 359, 8)            0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 357, 16)           400       
_________________________________________________________________
max_pooling1d_13 (MaxPooling (None, 89, 16)            0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 87, 32)            1568      
_________________________________________________________________
max_pooling1d_14 (MaxPooling (None, 21, 32)            0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 19, 64)            6208      
_________________________________________________________________
max_pooling1d_15 (MaxPooling (None, 4, 64)             0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 256)               0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 200)               51400     
_________________________________________________________________
dense_10 (Dense)             (None, 20)                4020      
_________________________________________________________________
dropout_7 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 21        
=================================================================
Total params: 63,649
Trainable params: 63,649
Non-trainable params: 0
_________________________________________________________________
