Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1440, 1)           0         
_________________________________________________________________
conv1d (Conv1D)              (None, 1432, 16)          160       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 358, 16)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 350, 32)           4640      
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 87, 32)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 79, 64)            18496     
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 19, 64)            0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 11, 128)           73856     
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 2, 128)            0         
_________________________________________________________________
flatten (Flatten)            (None, 256)               0         
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dense (Dense)                (None, 200)               51400     
_________________________________________________________________
dense_1 (Dense)              (None, 20)                4020      
_________________________________________________________________
dropout_1 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 21        
=================================================================
Total params: 152,593
Trainable params: 152,593
Non-trainable params: 0
_________________________________________________________________
