Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_3 (Reshape)          (None, 1440, 1)           0         
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 1438, 8)           32        
_________________________________________________________________
max_pooling1d_20 (MaxPooling (None, 719, 8)            0         
_________________________________________________________________
conv1d_21 (Conv1D)           (None, 717, 16)           400       
_________________________________________________________________
max_pooling1d_21 (MaxPooling (None, 358, 16)           0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 356, 32)           1568      
_________________________________________________________________
max_pooling1d_22 (MaxPooling (None, 178, 32)           0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 176, 64)           6208      
_________________________________________________________________
max_pooling1d_23 (MaxPooling (None, 88, 64)            0         
_________________________________________________________________
conv1d_24 (Conv1D)           (None, 86, 128)           24704     
_________________________________________________________________
max_pooling1d_24 (MaxPooling (None, 43, 128)           0         
_________________________________________________________________
conv1d_25 (Conv1D)           (None, 41, 256)           98560     
_________________________________________________________________
max_pooling1d_25 (MaxPooling (None, 20, 256)           0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 5120)              0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 5120)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 1000)              5121000   
_________________________________________________________________
dense_11 (Dense)             (None, 200)               200200    
_________________________________________________________________
dense_12 (Dense)             (None, 20)                4020      
_________________________________________________________________
dropout_7 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_13 (Dense)             (None, 1)                 21        
=================================================================
Total params: 5,456,713
Trainable params: 5,456,713
Non-trainable params: 0
_________________________________________________________________
